/*
   Localizable.strings - Spanish
   modizer

   Organized by screens and feature families
*/

// ================================
// MARK: - COMMON / GENERAL
// ================================

/* Common Actions */
"Yes" = "Sí";
"No" = "No";
"Ok" = "Ok";
"Cancel" = "Cancelar";
"Close" = "Cerrar";
"Save" = "Guardar";
"Delete" = "Eliminar";
"Rename" = "Renombrar";
"Extract" = "Extraer";
"Cut" = "Cortar";
"Paste" = "Pegar";
"Create" = "Crear";
"Reset" = "Restablecer";

/* Common States */
"Loading" = "Cargando";
"Extracting" = "Extrayendo";
"Seeking" = "Buscando";
"Seeking %d%%" = "Buscando %d%%";
"Refreshing" = "Actualizando";
"Browsing" = "Navegando";
"Cancelling..." = "Cancelando...";

/* Common Messages */
"Error" = "Error";
"OK" = "OK";
"Warning" = "Advertencia";
"Do you want to reset to default value:\n" = "¿Deseas restablecer al valor predeterminado:\n";


// ================================
// MARK: - BROWSER
// ================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "Exploración local";
"Browser_LocalBrowsing_SubKey" = "Explorar, reproducir y eliminar archivos locales.";

"Browser_MODLAND_MainKey" = "Colección MODLAND";
"Browser_MODLAND_SubKey" = "%d archivos descargables.";

"Browser_HVSC_MainKey" = "Colección HVSC";
"Browser_HVSC_SubKey" = "%d archivos descargables.";

"Browser_Playlists_MainKey" = "Listas de reproducción";
"Browser_Playlists_SubKey" = "Organizar, crear, eliminar y escuchar.";

"Browser_Favorites_MainKey" = "Favoritos";
"Browser_Favorites_SubKey" = "Escuchar canciones valoradas.";

"Browser_Most_played_MainKey" = "Más reproducidas";
"Browser_Most_played_SubKey" = "Escuchar canciones más reproducidas.";

"Browser_Web_MainKey" = "Web";
"Browser_Web_SubKey" = "Navegar por Internet y descargar música.";

"Browser_WorldCharts_MainKey" = "Listas mundiales";
"Browser_WorldCharts_SubKey" = "Listas principales y enlaces de descarga.";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "Música de videojuegos extraída";

"Browser_UserGuide_MainKey" = "Guía del usuario";
"Browser_UserGuide_SubKey" = "Manual, FAQ, consejos.";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "Obtener todas las entradas faltantes";
"GetAllEntries_SubKey" = "Limitado a las primeras 256 entradas faltantes.";

"DisplayAll_MainKey" = "Listar todo ordenado por nombre";
"DisplayAll_SubKey" = "Directorio actual:";

"DisplayDir_MainKey" = "Lista/Directorio";
"DisplayDir_SubKey" = "Todo ordenado por ruta:";

"DisplayAllPath_MainKey" = "Listar todo ordenado por ruta";
"DisplayAllPath_SubKey" = "Todo ordenado por nombre:";

/* Browser View Modes */
"Formats/Artists/Files" = "Formatos/Artistas/Archivos";
"Artists/Formats/Files" = "Artistas/Formatos/Archivos";
"Artists/Files" = "Artistas/Archivos";
"Formats: %d entries." = "Formatos: %d entradas.";
"Artists: %d entries." = "Artistas: %d entradas.";

/* Browser Stats */
"Played %d times." = "Reproducido %d veces.";
"Played once." = "Reproducido una vez.";
"Never played." = "Nunca reproducido.";
"%d files." = "%d archivos.";
"1 file." = "1 archivo.";
"Size: %dKB" = "Tamaño: %dKB";

/* Browser Messages */
"Browser not enough mem." = "Demasiadas entradas, no se puede asignar memoria.";
"Browser not enough mem. Limited." = "Demasiadas entradas, no se puede asignar memoria. La lista está incompleta.";

/* File Operations */
"New folder" = "Nueva carpeta";
"Enter folder name" = "Introducir nombre de carpeta";
"Nothing to paste" = "Nada que pegar";
"No file to extract or not supported archive format.\n" = "No hay archivo para extraer o formato de archivo no compatible.\n";
"Cannot use iCloud as folder name" = "No se puede usar iCloud como nombre de carpeta";

"Issue %d while trying to delete entry.\n%@" = "Problema %d al intentar eliminar la entrada.\n%@";
"Issue %d while trying to renamefile.\n%@" = "Problema %d al intentar renombrar archivo.\n%@";
"Issue %d while moving: %@.\n%@" = "Problema %d al mover: %@.\n%@";
"Issue %d while creating folder\n%@" = "Problema %d al crear carpeta\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "El archivo no está disponible localmente.\nIniciando descarga desde iCloud, por favor verifica en la aplicación 'Archivos'.";

"unavailable" = "no disponible";

// ================================
// MARK: - SEARCH
// ================================

/* Search States */
"Playlist (%d)" = "Lista de reproducción (%d)";
"Playlist/Search off" = "Lista de reproducción/Búsqueda desactivada";

"Local (%d, limited to %d)" = "Local (%d, limitado a %d)";
"Local (%d)" = "Local (%d)";
"Local/Search off" = "Local/Búsqueda desactivada";

"Modland (%d, limited to %d)" = "Modland (%d, limitado a %d)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/Búsqueda desactivada";

"HVSC (%d, limited to %d)" = "HVSC (%d, limitado a %d)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/Búsqueda desactivada";

"ASMA (%d, limited to %d)"="ASMA (%d, limitado a %d)";
"ASMA (%d)"="ASMA (%d)";
"ASMA/Search off"="ASMA/Búsqueda desactivada";

/* Search Messages */
"Searching Playlists..." = "Buscando listas de reproducción...";
"Searching Local files..." = "Buscando archivos locales...";
"Searching MODLAND..." = "Buscando en MODLAND...";
"Searching HVSC..." = "Buscando en HVSC...";

"Please enter at least 2 characters for your search." = "Por favor introduce al menos 2 caracteres para tu búsqueda.";
"Please activate at least 1 section for your search." = "Por favor activa al menos 1 sección para tu búsqueda.";


// ================================
// MARK: - PLAYER / NOW PLAYING
// ================================

/* Player States */
"Now playing" = "Reproduciendo ahora";
"Now playing(%d)" = "Reproduciendo ahora(%d)";
"Most played" = "Más reproducidas";
"Favorites" = "Favoritos";
"Resuming last\nplayed file" = "Reanudando último\narchivo reproducido";

/* Player Controls */
"Previous" = "Anterior";
"Previous file" = "Archivo anterior";
"Next file" = "Archivo siguiente";
"Next" = "Siguiente";
"Shuffle" = "Aleatorio";
"Voices control" = "Control de voces";
"All voices" = "Todas las voces";
"Clear 'Now Playing' queue" = "Limpiar cola 'Reproduciendo ahora'";

/* Song Selection */
"Choose a subsong" = "Elegir una subcanción";
"Choose a song" = "Elegir una canción";

/* Player Messages */
"Nothing currently playing. Please select a file." = "Nada reproduciéndose actualmente. Por favor selecciona un archivo.";
"File cannot be played. Skipping to next playable file." = "El archivo no se puede reproducir. Saltando al siguiente archivo reproducible.";
"Too much entries! Playlist will be limited to %d first entries." = "¡Demasiadas entradas! La lista de reproducción se limitará a las primeras %d entradas.";
"Playlist is full. Delete some entries to add more." = "La lista de reproducción está llena. Elimina algunas entradas para añadir más.";

/* Metadata */
"unknown_title" = "Título desconocido";
"unknown_album" = "Álbum desconocido";
"now_playing_format" = "Reproduciendo: %@ de %@";


// ================================
// MARK: - PLAYLISTS
// ================================

/* Playlist Actions */
"New playlist" = "Nueva lista de reproducción";
"Create new playlist" = "Crear nueva lista de reproducción";
"Save current one" = "Guardar la actual";
"Rename playlist" = "Renombrar lista de reproducción";
"Add to a playlist" = "Añadir a una lista de reproducción";
"Choose a playlist" = "Elegir una lista de reproducción";

/* Playlist Descriptions */
"Create a new empty playlist." = "Crear una nueva lista de reproducción vacía.";
"Create a playlist from currently played files." = "Crear una lista de reproducción con los archivos reproducidos actualmente.";
"Browse files" = "Explorar archivos";
"Add or remove entries from browser." = "Añadir o eliminar entradas desde el explorador.";
"Choose a new name." = "Elegir un nuevo nombre.";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "¿Estás seguro de que deseas eliminar esta lista de reproducción?";
"Are you sure you want to delete this entry ?" = "¿Estás seguro de que deseas eliminar esta entrada?";


// ================================
// MARK: - DOWNLOADS
// ================================

"Downloads" = "Descargas";
"Download queue: 1 file" = "Cola de descarga: 1 archivo";
"Download queue: %d files" = "Cola de descarga: %d archivos";
"No download in progress" = "No hay descargas en progreso";
"Downloaded %@" = "Descargado %@";
"Downloading %@" = "Descargando %@";
"Cannot download from this URL." = "No se puede descargar desde esta URL.";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "No se pudieron añadir archivos. Por favor verifica manualmente con el explorador de archivos (Exploración local/Descargas).";
"File already available locally. Do you want to download it again?" = "Archivo ya disponible localmente. ¿Deseas descargarlo de nuevo?";
"URL have to start with ftp:// or http://" = "La URL debe comenzar con ftp:// o http://";
"Cannot connect to FTP." = "No se puede conectar al FTP.";


// ================================
// MARK: - DATABASE
// ================================

"Database created." = "Base de datos creada.";
"Database will now be recreated. Please validate & wait." = "La base de datos se recreará ahora. Por favor valida y espera.";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "Versión de base de datos incorrecta: %d.%d. Se actualizará a %d.%d. Por favor valida y espera.";
"No database found. Will create a new one. Please validate & wait..." = "No se encontró base de datos. Se creará una nueva. Por favor valida y espera...";


// ================================
// MARK: - COVERS / IMAGES
// ================================

"Image detected" = "Imagen detectada";
"Choose_SaveCover" = "¿Guardar imagen como portada para %@?";
"CoverFolder" = "Como portada de carpeta";
"CoverFile" = "Como portada de archivo";
"Confirm_RemCurCovers" = "¿Eliminar portadas actuales para %@ (carpeta y archivo)?";


// ================================
// MARK: - SETTINGS - GENERAL
// ================================

/* Settings Sections */
"Settings_General" = "General";
"Settings_Player" = "Reproductor";
"Settings_Display" = "Pantalla";
"Settings_Download" = "Descarga";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "Bibliotecas de reproducción";
"Settings_Settings" = "Ajustes";

/* Settings Presets */
"Settings_SettingsDefault" = "Predeterminado";
"Settings_SettingsHigh" = "Alto";
"Settings_SettingsMed" = "Medio";
"Settings_SettingsLow" = "Bajo";

"Confirm_SettingsDef" = "¿Estás seguro de que deseas restablecer los ajustes con valores 'predeterminados'?";
"Confirm_SettingsHigh" = "¿Estás seguro de que deseas restablecer los ajustes con valores 'altos'?";
"Confirm_SettingsMed" = "¿Estás seguro de que deseas restablecer los ajustes con valores 'medios'?";
"Confirm_SettingsLow" = "¿Estás seguro de que deseas restablecer los ajustes con valores 'bajos'?";

/* Global Player Settings */
"Search: simplified regexp ('.'->'\\.', '*'->'.*')" = "Búsqueda: regexp simplificado ('.'->'\\.', '*'->'.*')";
"Resume position on launch" = "Reanudar posición al iniciar";
"Notification" = "Notificación";
"Notification duration" = "Duración de notificación";
"Disable screen auto lock" = "Desactivar bloqueo automático de pantalla";
"No screen auto lock" = "Sin bloqueo automático de pantalla";
"Enable playback ratio" = "Activar relación de reproducción";
"Playback ratio" = "Relación de reproducción";
"Default length" = "Duración predeterminada";
"Default length %d:%.2d" = "Duración predeterminada %d:%.2d";
"Fade-out time" = "Tiempo de desvanecimiento";
"Silence Detection" = "Detección de silencio";
"Stop song if silent for more than selected number of seconds. 0: off" = "Detener canción si está en silencio durante más del número de segundos seleccionado. 0: desactivado";
"Will skip song if nothing is played for specified duration (0=off)" = "Saltará la canción si no se reproduce nada durante la duración especificada (0=desactivado)";
"Force mono" = "Forzar mono";
"Panning" = "Paneo";
"Panning value" = "Valor de paneo";
"Audio latency" = "Latencia de audio";
"Audio latency in ms" = "Latencia de audio en ms";
"Multi default action" = "Acción predeterminada múltiple";
"Browse" = "Explorar";
"Archive/multi play mode" = "Modo de reproducción archivo/múltiple";
"Entry"="Entrada";

/* Archive Settings */
"Archive multi default action" = "Acción predeterminada archivo múltiple";
"Archive multi play mode" = "Modo de reproducción archivo múltiple";

/* Playlist Settings */
"Play/Enqueue action" = "Acción Reproducir/Encolar";
"Enqueue mode" = "Modo de encolar";
"Default Action" = "Acción predeterminada";
"Play" = "Reproducir";
"Enqueue" = "Encolar";
"Enq.&Play" = "Encolar y reproducir";
"First" = "Primero";
"Current" = "Actual";
"Last" = "Último";
"Enqueue position" = "Posición de encolar";
"Post download action" = "Acción posterior a descarga";
"Nothing" = "Nada";

/* Display Settings */
"Background mode" = "Modo en segundo plano";
"Partial" = "Parcial";
"Full" = "Completo";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "Desactivado=sin proceso en segundo plano, Parcial=seguir reproduciendo música, Completo=mantener app en segundo plano";
"Long name truncate" = "Truncar nombre largo";
"Head" = "Inicio";
"Mid." = "Medio";
"Tail" = "Final";
"Filename as title" = "Nombre de archivo como título";

/* Local Files Settings */
"Auto. restore Samples folder" = "Restaurar automáticamente carpeta de muestras";
"Send statistics" = "Enviar estadísticas";


// ================================
// MARK: - SETTINGS - DATABASE
// ================================

"Settings_DB" = "Base de datos";
"Settings_CleanDB" = "Limpiar base de datos";
"Settings_ResetPlCnt" = "Restablecer contadores de reproducción";
"Settings_ResetRatings" = "Restablecer valoraciones";
"Settings_ResetDB" = "Restablecer toda la base de datos";

"Confirm_DBClean" = "¿Iniciar limpieza de base de datos (puede tardar un rato)?";
"Confirm_Reset_PlCnt" = "¿Estás seguro de que deseas restablecer todos los contadores de reproducción?";
"Confirm_Reset_Ratings" = "¿Estás seguro de que deseas restablecer todas las valoraciones?";
"Confirm_ResetDB" = "¿Estás seguro de que deseas restablecer toda la base de datos? Se eliminarán las listas de reproducción, valoraciones y contadores.";


// ================================
// MARK: - SETTINGS - LOCAL FILES
// ================================

"Settings_LocalFiles" = "Archivos locales";
"Settings_RecreateSamples" = "Recrear carpeta 'Muestras'";
"Settings_FormatDownloads" = "Formatear carpeta 'Descargas'";
"Settings_RemCovers" = "Eliminar portadas";
"Settings_UpdateFilesBackupFlag" = "Verificar sistema de archivos";

"Confirm_RecreateSamples" = "¿Deseas recrear la carpeta 'Muestras'?";
"Confirm_FormatDownloads" = "¿Deseas eliminar TODOS los archivos de la carpeta Exploración local/Web?";
"Confirm_CheckFiles" = "¿Deseas realizar una verificación del sistema de archivos local?";


// ================================
// MARK: - SETTINGS - PLUGINS
// ================================

/* AdPlug */
"OPL type" = "Tipo OPL";
"Stereo surround" = "Estéreo envolvente";

/* GBSPlay */
"HP filter type" = "Tipo de filtro HP";
"Highpass filter type" = "Tipo de filtro paso alto";

/* Game Music Emu (GME) */
"Stereo separation" = "Separación estéreo";
"Ignore silence" = "Ignorar silencio";
"Silence detection" = "Detección de silencio";
"Equalizer" = "Ecualizador";
"Bass" = "Graves";
"Treble" = "Agudos";

/* GSF */
"Sound quality" = "Calidad de sonido";
"Interpolation" = "Interpolación";
"Low-pass filter" = "Filtro paso bajo";
"Echo" = "Eco";

/* Highly Complete (HC) */
"Resample quality" = "Calidad de remuestreo";
"Main enabled" = "Principal activado";
"Reverb enabled" = "Reverberación activada";

/* NSFPlay */
"NSFPLAY default length" = "Duración predeterminada NSFPLAY";
"LPF strength" = "Fuerza LPF";
"Min=off, default: 112" = "Mín=desactivado, predeterminado: 112";
"HPF strength" = "Fuerza HPF";
"Region" = "Región";
"VRC7 Patches" = "Parches VRC7";
"Force IRQ" = "Forzar IRQ";
"Quality" = "Calidad";

/* OpenMPT */
"Master volume" = "Volumen maestro";
"Sampling" = "Muestreo";
"Resampling" = "Remuestreo";

/* SID */
"Engine" = "Motor";
"Filter" = "Filtro";
"Force loop" = "Forzar bucle";
"Clock" = "Reloj";
"Model" = "Modelo";
"Force 2nd SID" = "Forzar 2do SID";
"Address 2nd" = "Dirección 2do";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF o 0xDE00-0xDFFF";
"Force 3rd SID" = "Forzar 3er SID";
"Address 3rd" = "Dirección 3er";

/* Timidity */
"Max loop" = "Bucle máximo";
"MIDI polyphony" = "Polifonía MIDI";
"Amplification" = "Amplificación";
"Chorus" = "Coro";
"Reverb" = "Reverberación";
"Resample" = "Remuestrear";
"LP filter" = "Filtro LP";

/* UADE */
"Headphones" = "Auriculares";
"LED filter" = "Filtro LED";
"Normalization" = "Normalización";
"Post FX" = "Post FX";
"Panning" = "Paneo";
"Panning value" = "Valor de paneo";
"Gain" = "Ganancia";
"Gain value" = "Valor de ganancia";
"Force NTSC" = "Forzar NTSC";

/* VGMPlay */
"Prefer JTAG" = "Preferir JTAG";
"YM2612 emulator" = "Emulador YM2612";
"Nuked OPN2 option" = "Opción Nuked OPN2";
"YMF262 emulator" = "Emulador YMF262";
"YM3812 emulator" = "Emulador YM3812";
"QSound emulator" = "Emulador QSound";
"RF5C68 emulator" = "Emulador RF5C68";

/* VGMStream */
"Max loop" = "Bucle máximo";

/* XMP */
"Amiga 500 Filter" = "Filtro Amiga 500";


// ================================
// MARK: - SETTINGS - VISUALIZATIONS
// ================================

/* General FX */
"FX Alpha" = "Alfa FX";
"FX Fullscreen" = "FX pantalla completa";
"FX FPS" = "FPS FX";
"FX show info" = "Mostrar info FX";
"Tech Info" = "Info técnica";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "Mostrar FPS y otra información (CPU, Resolución, datos de audio ProjectM)";
"FX Level of details" = "Nivel de detalles FX";
"Low" = "Bajo";
"Med" = "Medio";
"High" = "Alto";
"Slow FX limit" = "Límite FX lento";
"Deactivate FX if too slow." = "Desactivar FX si es demasiado lento.";
"Weak" = "Débil";
"Strong" = "Fuerte";
"Display song info" = "Mostrar información de canción";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "En pantalla completa, mostrar información de canción cuando cambia. TL es Superior izquierda, DR es Inferior derecha, C es Centro.";

/* ProjectM */
"ProjectM settings" = "Ajustes ProjectM";
"ProjectM on/off" = "ProjectM activado/desactivado";
"Show preset label" = "Mostrar etiqueta de preset";
"Auto switch presets mode" = "Modo cambio automático de presets";
"Lock preset" = "Bloquear preset";
"Time between preset" = "Tiempo entre presets";
"Blend presets" = "Mezclar presets";
"Blend time" = "Tiempo de mezcla";
"Bundled presets" = "Presets incluidos";
"Custom presets" = "Presets personalizados";
"Aspect ratio" = "Relación de aspecto";
"Mesh size X" = "Tamaño de malla X";
"Mesh size Y" = "Tamaño de malla Y";
"Hard cut enabled" = "Corte duro activado";
"Hard cut min time" = "Tiempo mínimo de corte duro";
"Hard cut sensitivity" = "Sensibilidad de corte duro";
"Beat sensitivity" = "Sensibilidad de ritmo";
"Permissive mode" = "Modo permisivo";

/* Oscilloscope */
"Oscillo settings" = "Ajustes de osciloscopio";
"FX mode" = "Modo FX";
"Show label" = "Mostrar etiqueta";
"Label font size" = "Tamaño de fuente de etiqueta";
"Show grid" = "Mostrar cuadrícula";
"Grid color" = "Color de cuadrícula";
"Line width" = "Ancho de línea";
"Mono color" = "Color mono";
"Multi color set" = "Conjunto de colores múltiples";
"Reset all colors" = "Restablecer todos los colores";
"Thin" = "Fino";
"Medium" = "Medio";
"Thick" = "Grueso";
"Beefy" = "Muy grueso";

/* Piano Roll / MIDI */
"Piano roll" = "Piano roll";
"Activate Piano roll FX, standard or 'Synthesia' like" = "Activar FX Piano roll, estándar o tipo 'Synthesia'";
"Activate spark FX, colored or white" = "Activar FX chispa, coloreado o blanco";
"Display voices labels" = "Mostrar etiquetas de voces";
"Display octaves labels" = "Mostrar etiquetas de octavas";
"MIDI pattern" = "Patrón MIDI";
"MIDI cut line" = "Línea de corte MIDI";
"MIDI bar style" = "Estilo de barra MIDI";
"MIDI bar vibrato" = "Vibrato de barra MIDI";
"Piano 3D" = "Piano 3D";
"Piano cut line" = "Línea de corte de piano";
"Piano color mode" = "Modo de color de piano";

/* Spectrum */
"3D spectrum" = "Espectro 3D";
"3D spectrum bloom" = "Bloom de espectro 3D";
"Spectrum" = "Espectro";
"3D landscape" = "Paisaje 3D";
"3D landscape bloom" = "Bloom de paisaje 3D";

/* MOD Pattern */
"MOD pattern" = "Patrón MOD";
"MOD pattern BG alpha" = "Alfa de fondo de patrón MOD";
"MOD pattern vol bar" = "Barra de volumen de patrón MOD";
"MOD pattern current line mode" = "Modo de línea actual de patrón MOD";
"MOD pattern font" = "Fuente de patrón MOD";
"MOD pattern font size" = "Tamaño de fuente de patrón MOD";
"MOD pattern theme" = "Tema de patrón MOD";


// ================================
// MARK: - WEB BROWSER
// ================================

"Browser_Welcome_Message" = "<b>¡Bienvenido al navegador web de Modizer!</b><br><br>Usa la barra de direcciones arriba para navegar o explora tus marcadores.<br><br>Para usar una imagen como portada, cópiala en el portapapeles con una pulsación larga (iOS) o clic derecho (macOS).";
"Bookmarks" = "Marcadores";


// ================================
// MARK: - ABOUT
// ================================

"About_Text" = "v4.1 © Yohann Magnien / YoyoFR\n\nContacto: mailto:modizerhelp@gmail.com\nWeb: https://modizer.app\n\nLogo de Modizer por Steve Miele.\n\nNúmero de formatos/extensiones de archivo compatibles: 1090.\n!PM!,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,50A,60A,61A,669,800,9TAV,A2M,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GTD,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,S98xxxxxxxxx,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTH,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\nBibliotecas de reproducción integradas:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(usando fuente de sonido SF2 Merlin_gold)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebSID\n- ZXTune\n\nDescargo de responsabilidad:\nLos accesos a Internet a las bibliotecas Modland, HVSC y ASMA se proporcionan como un servicio tal cual, sin garantía de disponibilidad y/o funcionalidad. Usa esta aplicación bajo tu propio riesgo.";


// ================================
// MARK: - SUPPORT
// ================================

"Mail support" = "Soporte por correo";
"Contact support by email" = "Contactar con soporte por correo electrónico";
"[Please describe your request below]" = "[Por favor describe tu solicitud a continuación]";


// ================================
// MARK: - DONATION / TIPS
// ================================

"Thank You! ❤️" = "¡Gracias! ❤️";
"Send a tip to Modizer" = "Enviar una propina a Modizer";
"Support Modizer development" = "Apoyar el desarrollo de Modizer";


// ================================
// MARK: - LAUNCH / INITIALIZATION
// ================================

"Cleaning DB & \nreseting settings" = "Limpiando BD y\nrestableciendo ajustes";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "Primer lanzamiento o problema encontrado la última vez que se ejecutó Modizer. ¿Aplicar ajustes predeterminados?";


// ================================
// ================================
// MARK: - SIRI / APP INTENTS
// ================================

/* Títulos de intenciones */
"Play" = "Reproducir";
"Pause" = "Pausar";
"Stop" = "Detener";
"Next Song" = "Canción siguiente";
"Previous Song" = "Canción anterior";
"Play Subsong" = "Reproducir subcanción";
"Seek" = "Buscar";
"Set Infinite Loop" = "Establecer bucle infinito";
"Set Loop Mode" = "Establecer modo de repetición";
"Set Shuffle Mode" = "Establecer modo aleatorio";
"Toggle Shuffle" = "Alternar aleatorio";
"Toggle Loop Mode" = "Alternar modo de repetición";
"Set Fullscreen mode" = "Establecer modo pantalla completa";
"Go the player view" = "Ir a la vista del reproductor";
"Set FX" = "Establecer FX";
"Get Now Playing" = "Obtener reproducción actual";
"Get Playlists" = "Obtener listas de reproducción";
"Play some music" = "Reproducir música";
"Play most played" = "Reproducir más reproducidas";
"Play favorites" = "Reproducir favoritas";
"Play Playlist" = "Reproducir lista";
"Play Playlist By Name" = "Reproducir lista por nombre";

/* Descripciones de intenciones */
"Starts playing music in Modizer." = "Inicia la reproducción de música en Modizer.";
"Pauses music playback in Modizer." = "Pausa la reproducción de música en Modizer.";
"Stops music playback in Modizer." = "Detiene la reproducción de música en Modizer.";
"Skips to the next song in Modizer." = "Salta a la siguiente canción en Modizer.";
"Skips to the previous song in Modizer." = "Salta a la canción anterior en Modizer.";
"Plays a specific subsong in the current file." = "Reproduce una subcanción específica en el archivo actual.";
"Seeks to a specific position in the current song." = "Busca una posición específica en la canción actual.";
"Set the infinite loop mode in Modizer." = "Establece el modo de bucle infinito en Modizer.";
"Set the loop mode in Modizer." = "Establece el modo de repetición en Modizer.";
"Set the shuffle mode in Modizer." = "Establece el modo aleatorio en Modizer.";
"Toggles shuffle mode in Modizer." = "Alterna el modo aleatorio en Modizer.";
"Toggles loop mode in Modizer." = "Alterna el modo de repetición en Modizer.";
"Set Fullscreen mode on or off in Modizer." = "Activa o desactiva el modo de pantalla completa en Modizer.";
"Go the player view in Modizer." = "Va a la vista del reproductor en Modizer.";
"Set FX mode in Modizer." = "Establece el modo FX en Modizer.";
"Gets information about the currently playing song." = "Obtiene información sobre la canción que se está reproduciendo.";
"Gets the list of available playlists in Modizer." = "Obtiene la lista de listas de reproducción disponibles en Modizer.";
"Random picks from available local titles in Modizer." = "Selecciones aleatorias de títulos locales disponibles en Modizer.";
"Most played titles from available local titles in Modizer." = "Títulos más reproducidos de títulos locales disponibles en Modizer.";
"Favorites titles from available local titles in Modizer." = "Títulos favoritos de títulos locales disponibles en Modizer.";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "Reproduce una lista de reproducción específica en Modizer. Nota: Para mejores resultados con comandos de voz, use 'Reproducir lista por nombre' en su lugar.";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "Reproduce una lista de reproducción por nombre en Modizer. Recomendado para comandos de voz.";

/* Parámetros */
"Subsong Index" = "Índice de subcanción";
"The index of the subsong to play" = "El índice de la subcanción a reproducir";
"Position (seconds)" = "Posición (segundos)";
"The position to seek to in seconds" = "La posición a buscar en segundos";
"Relative" = "Relativo";
"Whether to seek relative to current position" = "Si se debe buscar en relación a la posición actual";
"Infinite Loop Mode" = "Modo de bucle infinito";
"0: off, 1: infinite loop" = "0: desactivado, 1: bucle infinito";
"Repeat Mode" = "Modo de repetición";
"0: off, 1: loop current title, 2: loop playlist" = "0: desactivado, 1: repetir título actual, 2: repetir lista";
"Shuffle Mode" = "Modo aleatorio";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: desactivado, 1: elegir solo un título si el archivo tiene subcanciones o es un archivo, 2: reproducir todos los títulos de un archivo dado";
"Fullscreen mode" = "Modo pantalla completa";
"Activate (1) or disactivate (0) Fullscreen mode" = "Activar (1) o desactivar (0) el modo de pantalla completa";
"FX" = "FX";
"The FX to set" = "El FX a establecer";
"FX Mode" = "Modo FX";
"The mode to activate for the selected FX (0:off)" = "El modo a activar para el FX seleccionado (0:desactivado)";
"Playlist" = "Lista de reproducción";
"The playlist to play" = "La lista de reproducción a reproducir";
"Start Index" = "Índice de inicio";
"The index of the song to start playing from (0-based)" = "El índice de la canción desde la que comenzar a reproducir (basado en 0)";
"Playlist Name" = "Nombre de la lista";
"The name of the playlist to play" = "El nombre de la lista de reproducción a reproducir";
"Which playlist would you like to play?" = "¿Qué lista de reproducción le gustaría reproducir?";

/* Mensajes de diálogo */
"play_playlist_dialog" = "Reproduciendo lista %@";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "Lista de reproducción no encontrada. Use 'Obtener listas de reproducción' para ver las listas disponibles.";
"No playlists found" = "No se encontraron listas de reproducción";

/* Nombres de FX */
"ProjectM" = "ProjectM";
"Oscillo" = "Osciloscopio";
"Piano roll" = "Rollo de piano";
"3D Piano" = "Piano 3D";
"Notes bars" = "Barras de notas";
"Tracker" = "Rastreador";
"2D Spectrum" = "Espectro 2D";
"3D Spectrum" = "Espectro 3D";
"3D Landscape" = "Paisaje 3D";

// ================================

"Get Now Playing" = "Obtener Reproduciendo ahora";
"Which playlist would you like to play?" = "¿Qué lista de reproducción te gustaría reproducir?";


// ================================
// MARK: - TABS
// ================================

"Search" = "Buscar";
"More" = "Más";
"Suspend" = "Suspender";
"Clear all" = "Limpiar todo";
"Online" = "En línea";


// ================================
// MARK: - MORE TAB
// ================================

"About" = "Acerca de";
"Some general informations" = "Información general";
"Settings" = "Ajustes";
"Global, Visu, FTP & Plugins" = "Global, Visualización, FTP y Plugins";
"Maintenance" = "Mantenimiento";
"Clean DB, Reset ratings, ..." = "Limpiar BD, Restablecer valoraciones, ...";


// ================================
// MARK: - ONLINE TAB / COLLECTIONS
// ================================

/* Section Headers */
"Collections" = "Colecciones";
"Browse Internet" = "Navegar por Internet";
"Games Music" = "Música de juegos";
"Mods & chiptunes" = "Mods y chiptunes";
"Other" = "Otro";

/* Collections */
"MODLAND collection" = "Colección MODLAND";
"HVSC collection" = "Colección HVSC";
"ASMA collection" = "Colección ASMA";
"JOSHW collection" = "Colección JOSHW";
"VGMRips collection" = "Colección VGMRips";
"SNESmusic collection" = "Colección SNESmusic";
"SMS Power! collection" = "Colección SMS Power!";
"ZXArt collection" = "Colección ZXArt";

/* Collection Descriptions */
"%d entries" = "%d entradas";
"Thousands of entries" = "Miles de entradas";
"2K+ packs / 40K+ songs" = "Más de 2K packs / Más de 40K canciones";
"1500+ sets / Super Nintendo/Famicom" = "Más de 1500 sets / Super Nintendo/Famicom";
"Master System & Game gear sets" = "Sets de Master System y Game gear";
"ZX Spectrum" = "ZX Spectrum";

/* Internet */
"Modizer World Charts" = "Listas mundiales de Modizer";
"Web browser" = "Navegador web";
"No internet connectivity or website down." = "Sin conectividad a Internet o sitio web caído.";

// ================================
// MARK: - SETTINGS - FAMILIES & UI
// ================================

/* Settings Families */
"Global" = "Global";
"Default Players" = "Reproductores predeterminados";
"Visualizers" = "Visualizadores";
"PR & NS colors settings" = "Ajustes de colores PR y NS";
"Plugins" = "Plugins";

/* Player Selection */
"MOD player" = "Reproductor MOD";
"SAP player" = "Reproductor SAP";
"SID player" = "Reproductor SID";
"VGM player" = "Reproductor VGM";
"YM player" = "Reproductor YM";
"NSF player" = "Reproductor NSF";
"PT3 player" = "Reproductor PT3";
"GBS player" = "Reproductor GBS";
"KSS player" = "Reproductor KSS";
"2SF player" = "Reproductor 2SF";
"MIDI player" = "Reproductor MIDI";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "Solo para plugins que admiten esta función (GME, NSFPLAY, LIBVGM)";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=auto, retraso redondeado a un múltiplo del tamaño del búfer de audio";
"Limited: not for subsong" = "Limitado: no para subcanciones";
"Default value is 3s" = "El valor predeterminado es 3s";
"Default action when selecting an archive or a multisong file" = "Acción predeterminada al seleccionar un archivo o un archivo multicanción";
"Play only selected entry or full archive/multisong file" = "Reproducir solo la entrada seleccionada o archivo/multicanción completo";
"Show Welcome screen" = "Mostrar pantalla de bienvenida";
"Adplug priority for module" = "Prioridad de Adplug para módulo";

/* FTP Settings */
"Server status" = "Estado del servidor";
"FTP Server" = "Servidor FTP";
"Authorize anonymous" = "Autorizar anónimo";
"User" = "Usuario";
"Password" = "Contraseña";
"Port" = "Puerto";

/* Online Settings */
"MODLAND URL" = "URL de MODLAND";
"HVSC URL" = "URL de HVSC";
"ASMA URL" = "URL de ASMA";
"MODLAND Server" = "Servidor MODLAND";
"MODLAND cust.URL" = "URL personalizada MODLAND";
"HVSC Server" = "Servidor HVSC";
"HVSC cust.URL" = "URL personalizada HVSC";
"ASMA Server" = "Servidor ASMA";
"ASMA cust.URL" = "URL personalizada ASMA";


// ================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "Alfa de fondo de patrones";
"Opacity of mod patterns view" = "Opacidad de vista de patrones mod";
"MOD Color Theme" = "Tema de color MOD";
"MOD Current Line" = "Línea actual MOD";
"MOD Volume bars" = "Barras de volumen MOD";
"MOD Pattern Font" = "Fuente de patrón MOD";
"MOD Pattern Font Size" = "Tamaño de fuente de patrón MOD";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "FX Piano Roll";
"PR/Spark FX" = "FX PR/Chispa";
"Display voices label" = "Mostrar etiqueta de voces";
"Notes scroller FX" = "FX desplazador de notas";
"NS/bars mode" = "Modo NS/barras";
"NS/bars style" = "Estilo NS/barras";
"Vibrato display" = "Visualización de vibrato";
"Piano FX" = "FX Piano";
"Piano bars mode" = "Modo de barras de piano";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "Bloom espectro 3D";
"3D Land. Bloom" = "Bloom paisaje 3D";
"0: off" = "0: desactivado";

/* ProjectM Settings */
"ProjectM FX" = "FX ProjectM";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "Calidad de renderizado: Máx es resolución de píxel, 1/2 es la mitad, ...";
"Custom presets/textures should be copied in .projectm folder" = "Los presets/texturas personalizados deben copiarse en la carpeta .projectm";
"Display preset name" = "Mostrar nombre de preset";
"Lim: display and disappear quickly" = "Lim: mostrar y desaparecer rápidamente";
"Auto switch presets" = "Cambio automático de presets";
"Allow loading of milk file with script issues" = "Permitir carga de archivo milk con problemas de script";
"Default is 15s" = "Predeterminado es 15s";
"Default is 2.7s" = "Predeterminado es 2.7s";
"Default value is 32" = "Valor predeterminado es 32";
"Default value is 24" = "Valor predeterminado es 24";
"Default value is 20" = "Valor predeterminado es 20";
"Hardcut" = "Corte duro";
"Hardcut triggers presets switch synchronized with beats." = "Corte duro activa el cambio de presets sincronizado con los ritmos.";
"Hardcut min time" = "Tiempo mínimo de corte duro";
"Preserve aspect ratio for compatible shaders." = "Preservar relación de aspecto para shaders compatibles.";
"Default value is 1" = "Valor predeterminado es 1";
"Hardcut sensitivity" = "Sensibilidad de corte duro";

/* Oscilloscope Settings */
"Oscillo FX" = "FX Osciloscopio";
"Oscillo show labels" = "Osciloscopio mostrar etiquetas";
"Oscillo labels font size" = "Tamaño de fuente de etiquetas de osciloscopio";
"Oscillo show grid" = "Osciloscopio mostrar cuadrícula";
"Oscillo line width" = "Ancho de línea de osciloscopio";
"Reset all custom colors" = "Restablecer todos los colores personalizados";
"Multi color | System 1" = "Color múltiple | Sistema 1";
"Multi color | System 2" = "Color múltiple | Sistema 2";
"Multi color | System 3" = "Color múltiple | Sistema 3";
"Multi color | System 4" = "Color múltiple | Sistema 4";
"Multi color | System 5" = "Color múltiple | Sistema 5";
"Multi color | System 6" = "Color múltiple | Sistema 6";
"Multi color | System 7" = "Color múltiple | Sistema 7";
"Multi color | System 8" = "Color múltiple | Sistema 8";

/* Piano/MIDI Colors */
"Custom color 01" = "Color personalizado 01";
"Custom color 02" = "Color personalizado 02";
"Custom color 03" = "Color personalizado 03";
"Custom color 04" = "Color personalizado 04";
"Custom color 05" = "Color personalizado 05";
"Custom color 06" = "Color personalizado 06";
"Custom color 07" = "Color personalizado 07";
"Custom color 08" = "Color personalizado 08";
"Custom color 09" = "Color personalizado 09";
"Custom color 10" = "Color personalizado 10";
"Custom color 11" = "Color personalizado 11";
"Custom color 12" = "Color personalizado 12";
"Custom color 13" = "Color personalizado 13";
"Custom color 14" = "Color personalizado 14";
"Custom color 15" = "Color personalizado 15";
"Custom color 16" = "Color personalizado 16";
"Custom color 17" = "Color personalizado 17";
"Custom color 18" = "Color personalizado 18";
"Custom color 19" = "Color personalizado 19";
"Custom color 20" = "Color personalizado 20";
"Custom color 21" = "Color personalizado 21";
"Custom color 22" = "Color personalizado 22";
"Custom color 23" = "Color personalizado 23";
"Custom color 24" = "Color personalizado 24";
"Custom color 25" = "Color personalizado 25";
"Custom color 26" = "Color personalizado 26";
"Custom color 27" = "Color personalizado 27";
"Custom color 28" = "Color personalizado 28";
"Custom color 29" = "Color personalizado 29";
"Custom color 30" = "Color personalizado 30";
"Custom color 31" = "Color personalizado 31";
"Custom color 32" = "Color personalizado 32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "Saltará la canción si no se reproduce nada durante la duración especificada (0=desactivado)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "Duración predeterminada";
"Oversampling. Min=0, default: 10" = "Sobremuestreo. Mín=0, predeterminado: 10";
"Min=off, default: 112" = "Mín=desactivado, predeterminado: 112";
"Max=off, default: 164" = "Máx=desactivado, predeterminado: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=forzar NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "Fuerza capacidad IRQ para todos los NSF, no solo NSF2";
"APU unmute on reset" = "APU desactivar silencio al restablecer";
"APU phase reset" = "Restablecimiento de fase APU";
"APU non linear mixing" = "Mezcla no lineal APU";
"APU swap duty 1/2" = "Intercambiar duty 1/2 APU";
"APU Initialize sweep unmute" = "Inicializar desactivar silencio de barrido APU";
"DMC enable $4011 writes" = "DMC habilitar escrituras $4011";
"DMC enable periodic noise" = "DMC habilitar ruido periódico";
"DMC unmute on reset" = "DMC desactivar silencio al restablecer";
"DMC anti clicking" = "DMC anti clic";
"DMC non linear mixer" = "Mezclador no lineal DMC";
"DMC randomize noise on reset" = "DMC aleatorizar ruido al restablecer";
"DMC mute triangle on pitch 0" = "DMC silenciar triángulo en tono 0";
"prevents high frequency aliasing" = "previene aliasing de alta frecuencia";
"DMC rand. triangle" = "DMC triángulo aleatorio";
"randomize triangle on reset" = "aleatorizar triángulo al restablecer";
"DMC reverse bits" = "DMC invertir bits";
"reverse bits of DPCM sample bytes" = "invertir bits de bytes de muestra DPCM";
"MMC5 non linear mixing" = "Mezcla no lineal MMC5";
"MMC5 Phase reset" = "Restablecimiento de fase MMC5";
"Reset phase counter after write $5003 and $5007" = "Restablecer contador de fase después de escribir $5003 y $5007";
"FDS LP filter in Hz" = "Filtro LP FDS en Hz";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "Frecuencia de corte (0Hz=desactivado, 2000Hz=predeterminado)";
"FDS reset \"phase\"" = "FDS restablecer \"fase\"";
"$4085 \"resets\" modular phase" = "$4085 \"restablece\" fase modular";
"FDS write protect" = "Protección de escritura FDS";
"write protect $8000-DFFF" = "proteger escritura $8000-DFFF";
"VRC7 Replace with OPLL" = "VRC7 Reemplazar con OPLL";
"N163 Serial Multiplex mixing" = "Mezcla multiplex serial N163";
"N163 Write Protect Phase" = "Fase de protección de escritura N163";
"N163 Limit Wavelength" = "Limitar longitud de onda N163";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "Solo para plugin HC";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "Digiboost";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "Valor de paneo";
"Gain value" = "Valor de ganancia";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "Desactivar";
"Enter playlist name" = "Introducir nombre de lista de reproducción";
"Ask" = "Preguntar";
"Play All" = "Reproducir todo";
"Single" = "Individual";
"Archive" = "Archivo";
"On" = "Activado";
"Off" = "Desactivado";
"Lim" = "Lim";

// ================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ================================

/* Playlist Menu Entries */
"Add a playlist" = "Añadir una lista de reproducción";
"Create a new playlist" = "Crear una nueva lista de reproducción";
"Now playing" = "Reproduciendo ahora";
"1 entry" = "1 entrada";
"No entry" = "Sin entradas";
"Random picks" = "Selección aleatoria";
"Generate a randomized playlist" = "Generar una lista de reproducción aleatoria";
"Most played" = "Más reproducidas";
"Favorites" = "Favoritos";

/* Playlist Actions */
"Add/Remove files..." = "Añadir/Eliminar archivos...";
"More actions..." = "Más acciones...";
"Save as a new playlist" = "Guardar como nueva lista de reproducción";

// ================================
// MARK: - WELCOME PAGES
// ================================

"Welcome to Modizer!\n" = "¡Bienvenido a Modizer!\n";
"Level up your library" = "Mejora tu biblioteca";
"Sound meets visuals." = "El sonido se encuentra con lo visual.";
"Made with passion,\noffered for free." = "Hecho con pasión,\nofrecido gratis.";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "Tu puerta de entrada a la música retro y tracker.\nPotencia tu dispositivo con melodías legendarias de juegos, módulos tracker icónicos y clásicos de chiptune atemporales.";

"Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "Navega y transmite desde catálogos en línea, para completar tus propias colecciones.\nConstruye, edita y escucha listas de reproducción sin esfuerzo.";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "Desbloquea visualizaciones clásicas de osciloscopio, barras de espectro, piano rolls, vista de trackers y efectos ProjectM/Milkdrop. Deja que Modizer pinte cada pista con movimiento y color.";

"If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "Si disfrutas de la app, las propinas son una gran manera de apoyar su desarrollo continuo.\nGracias por ayudar a mantener Modizer vivo y en evolución.";

"Skip" = "Saltar";

// ================================
// MARK: - TIPS / DONATIONS
// ================================

/* Tips Screen */
"Support with a Tip" = "Apoyar con una propina";
"Enjoy Modizer ?" = "¿Disfrutas de Modizer?";
"Your support helps keep Modizer running and ad-free!" = "¡Tu apoyo ayuda a mantener Modizer funcionando y sin anuncios!";
"Already tipped so far" = "Ya has dado propina hasta ahora";
"Thank you for your support! ❤️" = "¡Gracias por tu apoyo! ❤️";

/* Tip Tiers */
"Coffee" = "Café";
"Coffee & Croissant" = "Café y Croissant";
"Dinner" = "Cena";
"Loading..." = "Cargando...";

/* Tip Actions */
"Confirm Tip" = "Confirmar propina";
"Send Tip" = "Enviar propina";
"Send a %@ tip for %@?" = "¿Enviar una propina de %@ por %@?";
"Tip" = "Propina";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "No se pueden cargar los productos. Por favor verifica tu conexión a Internet.";

/* Thank You Alert */
"Thank You! ❤️" = "¡Gracias! ❤️";
"Your support means everything! Thank you for helping keep Modizer running." = "¡Tu apoyo lo es todo! Gracias por ayudar a mantener Modizer funcionando.";

// ================================
// MARK: - MAINTENANCE SCREEN
// ================================

/* Maintenance Actions */
"Clean Database" = "Limpiar base de datos";
"Clear 'Now Playing' queue" = "Limpiar cola 'Reproduciendo ahora'";
"Recreate Samples folder" = "Recrear carpeta de muestras";
"Reset settings to default" = "Restablecer ajustes a predeterminados";
"Remove current cover" = "Eliminar portada actual";
"Reset Ratings" = "Restablecer valoraciones";
"Reset Played Counters" = "Restablecer contadores de reproducción";
"Reset Database" = "Restablecer base de datos";
"Clear images cache" = "Limpiar caché de imágenes";

/* Maintenance Messages */
"Settings reseted" = "Ajustes restablecidos";
"Ratings reseted" = "Valoraciones restablecidas";
"Played Counters reseted" = "Contadores de reproducción restablecidos";
"Samples folder created" = "Carpeta de muestras creada";
"Cache cleaned" = "Caché limpiada";
"Database reseted" = "Base de datos restablecida";
"No cover to remove" = "No hay portada que eliminar";
"Cover removed" = "Portada eliminada";
"Database cleaned" = "Base de datos limpiada";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "¿Estás seguro de que deseas limpiar la BD, puede tardar un rato?";
"Clean" = "Limpiar";
"Cleaning DB" = "Limpiando BD";
"Cancelling..." = "Cancelando...";

// ================================
// MARK: - PLAYERMENU
// ================================

"Close FX\nwindow" = "Cerrar ventana\nde FX";
"All FX off" = "Todos los FX desactivados";
"FX\nalpha" = "Alfa\nFX";
"Show name\ntemp." = "Mostrar nombre\ntemp.";
"Show name" = "Mostrar nombre";
"Bundled\npresets" = "Presets\nincluidos";
"Custom\npresets" = "Presets\npersonalizados";
"Blend\npresets" = "Mezclar\npresets";
"Clear\nall" = "Limpiar\ntodo";
"Select\nall" = "Seleccionar\ntodo";
"Favorites" = "Favoritos";
"Expand" = "Expandir";
"Select\nlisted" = "Seleccionar\nenlistados";
"Remove\nlisted" = "Eliminar\nenlistados";
"Selected" = "Seleccionado";
"Collapse" = "Contraer";
"Labels" = "Etiquetas";
"Grid" = "Cuadrícula";
"Voices\nlabels" = "Etiquetas\nde voces";
"Octaves\nlabels" = "Etiquetas\nde octavas";
"Volume\nbars" = "Barras de\nvolumen";
"Fixed bar" = "Barra fija";
"BG\nopacity" = "Opacidad\nde fondo";
"Bloom:\n%s" = "Bloom:\n%s";
"Thickness:\n%s" = "Grosor:\n%s";
"Font size\n%s" = "Tamaño de fuente\n%s";
"Font:\n%s" = "Fuente:\n%s";
"Info HUD:\n%s" = "HUD de info:\n%s";
"Select active %s presets" = "Seleccionar presets %s activos";
"bundled" = "incluidos";
"custom" = "personalizados";
"Select\ncustom\npresets" = "Seleccionar\npresets\npersonalizados";
"Select\nbundled\npresets" = "Seleccionar\npresets\nincluidos";
"Themes:\n%s" = "Temas:\n%s";
